Revit 2015 API
BeamSystemTypeSetIterator Class
An iterator to a BeamSystem type set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public abstract class BeamSystemTypeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class BeamSystemTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class BeamSystemTypeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.BeamSystemTypeSetIterator
See Also
BeamSystemTypeSetIterator Members
Autodesk.Revit.DB Namespace